import { Component } from '@angular/core';

@Component({
  selector: 'app-record-size',
  templateUrl: './record-size.component.html',
  styleUrls: ['./record-size.component.css']
})
export class RecordSizeComponent {
  currentObject: any;

  car = [
    {
      name: "БелАЗ 75710",
      image: "./assets/images/car.jpg",
      description: 'Найбільший автомобіль в світі був розроблений і створений в Білорусії,' +
        ' на автомобільному заводі важкої спецтехніки ВАТ "БелАЗ" і називається наш кар\'єрний самоскид ' +
        '(а саме для кар\'єрів він і був виготовлений) БелАЗ-75710'
    }
  ]
  airplane = {
    name: "Ан-225 «Мрія»",
    image: "./assets/images/airplane.jpg",
    description: "Надважкий транспортний літак, створений 1988 року в СРСР київським КБ імені Антонова. До 2022 року Ан-225 був найбільшим та найпотужнішим літаком у світі. Головний конструктор — Віктор Толмачов. Літак створювався для потреб радянської космічної програми: для транспортування вантажів, космічного корабля «Буран» і компонентів ракетної системи «Енергія»."
  }
  ship = {
    name: "Harmony of the Seas (укр. Гармонія морів)",
    image: "./assets/images/ship.jpg",
    description: 'Найбільший круїзний лайнер у світі. Вага судна — 120 тисяч тонн, висота — 70 метрів, ширина — 66 метрів, загальна довжина — 362 метри. Побудова судна коштувала 1 мільярд євро. Належить американській компанії Royal Caribbean International, яка і інвестувала кошти в будівництво. Судно має 2744 пасажирських кают. Максимальна кількість людей на борту складає 6360 пасажирів та 2400 осіб команди судна.'
  }

  showCar() {
    this.currentObject = this.car[0];
  }

  showPlane() {
    this.currentObject = this.airplane;
  }

  showShip() {
    this.currentObject = this.ship;
  }


  // car: RecordSize = new RecordSize("БелАЗ 75710",
  // "./assets/images/car.jpg",
  // 'Найбільший автомобіль в світі був розроблений і створений в Білорусії,'+
  // ' на автомобільному заводі важкої спецтехніки ВАТ "БелАЗ" і називається наш кар\'єрний самоскид '+
  // '(а саме для кар\'єрів він і був виготовлений) БелАЗ-75710',
  // false);
  // airplane:RecordSize = new RecordSize("Ан-225 «Мрія»",
  // "./assets/images/airplane.jpg",
  // "Надважкий транспортний літак, створений 1988 року в СРСР київським КБ імені Антонова. До 2022 року Ан-225 був найбільшим та найпотужнішим літаком у світі. Головний конструктор — Віктор Толмачов. Літак створювався для потреб радянської космічної програми: для транспортування вантажів, космічного корабля «Буран» і компонентів ракетної системи «Енергія».",
  // false);
  // ship: RecordSize = new RecordSize("Harmony of the Seas (укр. Гармонія морів)",
  // "./assets/images/ship.jpg",
  // "найбільший круїзний лайнер у світі. Вага судна — 120 тисяч тонн, висота — 70 метрів, ширина — 66 метрів, загальна довжина — 362 метри. Побудова судна коштувала 1 мільярд євро. Належить американській компанії Royal Caribbean International, яка і інвестувала кошти в будівництво. Судно має 2744 пасажирських кают. Максимальна кількість людей на борту складає 6360 пасажирів та 2400 осіб команди судна.",
  // false);
}
